# ExcludedElementsRestoredInLink Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..GroupFailures..::..ExcludedElementsRestoredInLink Property
BuiltInFailures..::..GroupFailures Class See Also
---
Excluded elements restored in the link.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId ExcludedElementsRestoredInLink { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property ExcludedElementsRestoredInLink As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ ExcludedElementsRestoredInLink {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..GroupFailures Class
Autodesk.Revit.DB Namespace